# RampAttrShape Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RampAttrShape Property
ParameterTypeId Class See Also
---
"Shape"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RampAttrShape { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RampAttrShape As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RampAttrShape {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace